[
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "بِسْمِ اللَّهِ، وَالْحَمْدُ لِلَّهِ ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
				"transliteration": "Bismillaah, Alhamdu lillaah. Subhaanal-la<u>th</u>ee sakhkhara lanaa haa<u>th</u>aa wa maa kunnaa lahu muqrineen. Wa 'innaa 'ilaa Rabbinaa lamunqaliboon. Alhamdu lillaah, alhamdu lillaah, alhamdu lillaah, Allaahu 'Akbar, Allaahu 'Akbar, Allaahu 'Akbar, subhaanakal-laahumma 'innee dhalamtu nafsee faghfir lee, fa'innahu laa yaghfiru<u>th</u>-<u>th</u>unooba 'illaa 'Anta.",
				"translations_en": "With the Name of Allah. Praise is to Allah. Glory is to Him Who has provided this for us though we could never have had it by our efforts. Surely, unto our Lord we are returning. Praise is to Allah. Praise is to Allah. Praise is to Allah. Allah is the Most Great. Allah is the Most Great. Allah is the Most Great. Glory is to You. O Allah, I have wronged my own soul. Forgive me, for surely none forgives sins but You.",
				"bottom_en": "",
				"reference_en": "Abu Dawud 3/34, At-Tirmithi 5/501. See also Al-Albani, Sahih At-Tirmithi 3/156."
			}
		],
		"pageTitle_en": "When mounting an animal or any means of transport"
	},
	{
		"duas": [
			{
				"top_en": "Say three times:",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar",
				"translations_en": "Allah is the Most Great.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "..and then say:",
				"arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
				"transliteration": "Subhaanal-la<u>th</u>ee sakhkhara lanaa haa<u>th</u>aa wa maa kunnaa lahu muqrineen. Wa 'innaa 'ilaa Rabbinaa lamunqaliboon.",
				"translations_en": "Glory is to Him Who has provided this for us though we could never have had it by our efforts. Surely, unto our Lord we are returning.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ",
				"transliteration": "Allaahumma 'innaa nas'aluka fee safarinaa haathal-birrawattaqwaa, waminal-'amalimaa tardhaa, Allaahumma hawwin 'alaynaa safaranaa haa<u>th</u>aa watwi 'annaa bu'dahu, Allaahumma 'Antas-saahibu fis-safari, walkhaleefatu fil-'ahli,",
				"translations_en": "O Allah, we ask You on this our journey for goodness and piety, and for works that are pleasing to You. O Allah, lighten this journey for us and make its distance easy for us. O Allah, You are our Companion on the road and the One in Whose care we leave our family.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ",
				"transliteration": "Allaahumma 'innee 'a'oo<u>th</u>u bika min wa'thaa'is-safari, wa ka'aabanl-man<u>dh</u>ari, wa soo'il-munqalabi fil-maaliwal'ahli.",
				"translations_en": "O Allah, I seek refuge in You from this journey's hardships, and from the wicked sights in store and from finding our family and property in misfortune upon returning.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "Upon returning recite the same again adding:",
				"arabic": "آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
				"transliteration": "Aa'iboona, taa'iboona, 'aabidoona, Lirabbinaa haamidoon.",
				"translations_en": "We return repentant to our Lord, worshipping our Lord, and praising our Lord.",
				"bottom_en": "",
				"reference_en": "Muslim 2/978."
			}
		],
		"pageTitle_en": "Dua for travel"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّياطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ، وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا",
				"transliteration": "Allaahumma Rabbas-samaawaatis-sab'i wa maa 'a<u>dh</u>lalna, wa Rabbal-'aradheenas-sab'i wa maa 'aqlalna, wa Rabbash-shayaateeni wa maa 'adhlalna, wa Rabbar-riyaahi wa maa <u>th</u>arayna. 'As'aluka khayra haathihil-qaryati wa khayra 'ahlihaa, wa khayra maafeehaa, wa 'a'oo<u>th</u>u bika min sharrihaa, wa sharri 'ahlihaa, wa shard maa feehaa.",
				"translations_en": "O Allah, Lord of the seven heavens and all they overshadow, Lord of the seven worlds and all they uphold, Lord of the devils and all they lead astray, Lord of the winds and all they scatter. I ask You for the goodness of this town and for the goodness of its people, and for the goodness it contains. I seek refuge in You from its evil, from the evil of its people and from the evil it contains.",
				"bottom_en": "",
				"reference_en": "Al-Hakim who graded it authentic and Ath-Tfaahabi agreed 2/100, and Ibn As-Sunni (no. 524). Al-Hafidh graded it good in his checking of Al-'Athkdr 5/154. Ibn Baz said in Tuhfatul-'Akhydr p. 37, that An-Nasa'i recorded it with a good chain of narration."
			}
		],
		"pageTitle_en": "Upon entering a town or village"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لاَ يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu, yuhyee wa yumeetu, wa Huwa hayyun laa yamootu, biyadihil-khayru, wa Huwa 'alaa kulli shay'in Qadeer.",
				"translations_en": "None has the right to be worshipped but Allah alone, Who has no partener. His is the dominion and His is the praise. He brings life and He causes death, and He is living and does not die. In His Hand is all good, and He is Able to do all things.",
				"bottom_en": "",
				"reference_en": "At-Tirmithi 5/291, and Al-Hakim 1/538. Al-Albani graded it good in Sahih Ibn Majah 2/21 and Sahih At-Tirmithi 3/152.</p></div>"
			}
		],
		"pageTitle_en": "When entering the market"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "بِسْمِ اللَّهِ",
				"transliteration": "Bismillaahi.",
				"translations_en": "With the Name of Allah.",
				"bottom_en": "",
				"reference_en": "Abu Dawud 4/296. Al-Albani graded it authentic in Sahih Abu Dawud 3/941."
			}
		],
		"pageTitle_en": "When the mounted animal (or mean of transport) stumbles"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَسْتَوْدِعُكُمُ اللَّهَ الَّذِي لاَ تَضِيعُ وَدَائِعُهُ",
				"transliteration": "'Astawdi'ukumul-laahal-la<u>th</u>ee laa tadhee'u wadaa'i'uhu.",
				"translations_en": "I leave you in the care of Allah, as nothing is lost that is in His care.",
				"bottom_en": "",
				"reference_en": "Ahmad 2/403, Ibn Majah 2/943. See also Al-Albani, Sahih Ibn Majah 2/133."
			}
		],
		"pageTitle_en": "Dua of the traveller for the resident"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَسْتَوْدِعُ اللَّهَ دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ",
				"transliteration": "'Astawdi'ullaaha deenaka, wa 'amaanataka, wa khawaateema 'amalika.",
				"translations_en": "I leave your religion in the care of Allah, as well as your safety, and the last of your deeds.",
				"bottom_en": "",
				"reference_en": "Ahmad 2/7, At-Tirmithi 5/499. See also Al-Albani, Sahih At-Tirmithi 2/155."
			}
		],
		"pageTitle_en": "Dua of the resident for the traveller #1"
	},
	{
		"duas": [
			{
				"top_en": "Or:",
				"arabic": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُ مَا كُنْتَ",
				"transliteration": "Zawwadakal-laahut-taqwaa, wa ghafara <u>th</u>anbaka, wa yassara lakal-khayra haythu maa kunta.",
				"translations_en": "May Allah give you piety as your provision, forgive your sins, and make goodness easy for you wherever you are.",
				"bottom_en": "",
				"reference_en": "At-Tirmithi. See Al-Albani, Sahih At-Tirmithi, 3/155."
			}
		],
		"pageTitle_en": "Dua of the resident for the traveller #2"
	},
	{
		"duas": [
			{
				"top_en": "Jaabir (radhi-yAllaahu 'anhu) said: While ascending, we would say:",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar",
				"translations_en": "Allah is the Most Great",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "And when we descended we would say:",
				"arabic": "سُبْحَانَاللَّهِ",
				"transliteration": "Subhaanallaah",
				"translations_en": "Glory is to Allah.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 6/135."
			}
		],
		"pageTitle_en": "Dua while ascending or descending"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ، وَحُسْنِ بَلاَئِهِ عَلَيْنَا، رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا، عَائِذاً بِاللَّهِ مِنَ النَّارِ",
				"transliteration": "Sami'a saami'un bihamdillaahi wa husni balaa'ihi 'alaynaa. Rabbanaa saahibnaa, wa 'afdhil 'alaynaa 'aa'<u>ith</u>an billaahi minan-naar.",
				"translations_en": "He Who listens has heard that we praise Allah for the good things He gives us. Our Lord, be with us and bestow Your favor upon us. I seek the protection of Allah from the Fire.",
				"bottom_en": "",
				"reference_en": "Muslim 4/2086, the meaning of sami'a saami'un (who listens has heard) is that 'a witness has witnessed our praise of Allah due to His blessings and favor upon us.' It could also be read samma'a saami'un, in which case it means 'one who has heard this statement of mine will convey it to another and he will say it as well.' This is due to the attention given to the Thikr (remembrance of Allah) and supplications made during the early morning hours. The meaning of his saying 'Our Lord, be with us and bestow Your favor upon us' is: 'Our Lord, protect us and guard us. Bless us with Your numerous bounties, and avert from us every evil.' See An-Nawawi, Sharh Sahih Muslim 17/39."
			}
		],
		"pageTitle_en": "Prayer of the traveller as dawn approaches"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
				"transliteration": "'A'oo<u>th</u>u bikalimaatil-laahit-taammaati min sharri maa khalaq.",
				"translations_en": "I seek refuge in the Perfect Words of Allah from the evil of what He has created.",
				"bottom_en": "",
				"reference_en": "Muslim 4/2080."
			}
		],
		"pageTitle_en": "Stopping or lodging somewhere"
	},
	{
		"duas": [
			{
				"top_en": "Ibn 'Umar (radhi-yAllaahu 'anhaa) reported that the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) on return from a battle or from performing the pilgrimage would say at every high point:",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar.",
				"translations_en": "\"Allaah is the greatest\"",
				"bottom_en": "…three times.",
				"reference_en": ""
			},
			{
				"top_en": "...and then he would say:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku, wa lahul-hamdu, wa Huwa 'alaa kutti shay 'in Qadeer, 'aa'iboona, taa'iboona, 'aabidoona, lirabbinaa haamidoona, sadaqallaahu wa'dahu, wa nasara 'abdahu, wa hazamal-'ahzaaba wahdahu.",
				"translations_en": "None has the right to be worshipped but Allah alone, Who has no partener. His is the dominion and His is the praise, and He is Able to do all things. We return repentant to our Lord, worshipping our Lord, and praising our Lord. He fulfilled His Promise, He aided His slave, and He alone defeated the Confederates.",
				"bottom_en": "",
				"reference_en": "Bukhari 7/163, Muslim 2/980."
			}
		],
		"pageTitle_en": "While returning from travel"
	},
	{
		"duas": [
			{
				"top_en": "When He (sal-Allaahu 'alayhe wa sallam) used to receive pleasant news, He (sal-Allaahu 'alayhe wa sallam) would say:",
				"arabic": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
				"transliteration": "Alhamdu lillaahil-la<u>th</u>ee bini'matihi tatimmus-saalihaat.",
				"translations_en": "Praise is to Allah Who by His blessings all good things are perfected.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "And if something happened that displeased him, he used to say:",
				"arabic": "الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
				"transliteration": "Alhamdu lillaahi 'alaa kulli haal.",
				"translations_en": "Praise is to Allah in all circumstances.",
				"bottom_en": "",
				"reference_en": "Ibn As-Sunni, 'Amalul-Yawm wal-Laylah, and Al-Hakim who graded it authentic 1/499. See also Al-Albani, Sahihul-Jami' As-Saghir 4/201."
			}
		],
		"pageTitle_en": "Upon receiving pleasing or displeasing news"
	},
	{
		"duas": [
			{
				"top_en": "The Prophet (sal-Allaahu 'alayhe wa sallam) said: \"Whoever sends a prayer upon me, Allaah sends ten upon him.\" [1] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"Do not take my grave as a place of habitual ceremony. Send prayers upon me, for verily your prayers reach me wherever you are.\" [2] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"The miser is one whom when I am mentioned to him, fails to send prayers upon me.\" [3] \n\nHe (sal-Allaahu 'alayhe wa sallam) said: 'Allaah has Angels who roam the earth and convey salaam to me from my ummah.' [4] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: ''Whenever someone sends salaam upon me, Allaah returns my soul to me so that I may return salaam to that person. [5]",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": "[1] Muslim 1/288 No. 384.\n[2] Abu Dawud 2/218 No. 2044; Ahmed 2/367 No. 8804. Albani graded it as Sahih in Sahih Abu Dawud 2/363\n[3] At-Tirmithi 5/551 and others. See also Al-Albani, Sahih At-Tirmithi 3/177 and Sahihul-Jarai' As-Saghir 3/25.\n[4] An-Nasa'i, Al-Hakim 2/421. Al-Albani graded it authentic in Sahih An-Nasa'i 1/274.\n[5] Abu Dawud (no. 2041). Al-Albani graded it good in Sahih Abu Dawud 1/383."
			}
		],
		"pageTitle_en": "Excellence of sending prayers upon the Prophet"
	},
	{
		"duas": [
			{
				"top_en": "The Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) said: \"You shall not enter paradise until you believe, and you shall not believe until you love one another. Shall I not inform you of something, if you were to act upon it, you will indeed achieve mutual love for one another? Spread salaam amongst yourselves.\" [1] \n\n'Ammaar (radhi-yAllaahu 'anhu) said: \"Three characteristics, whoever combines them, has completed his faith: to be sincerely just, to spread greetings to all people and to spend [charitably] out of the little you have.\" [2] \n\n'Abdullaah Ibn 'Amr (radhi-yAllaahu 'anhu) reported that a man asked The Prophet (sal-Allaahu 'alayhe wa sallam): \"Which Islaam is the best?\". He (sal-Allaahu 'alayhe wa sallam) replied: Feed [the poor] , and greet those whom you know as well as those whom you do not.\" [3]",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": "[1] Muslim 1/74 No. 54 It used the wording, ''la Tadkhuluna…\" ''You will not enter''; Ahmed 1430;\n[2] Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 1/82 as a statement of the Companion 'Ammar (RA)\n[3] Fathul-Bari 1/55, Muslim 1/65"
			}
		],
		"pageTitle_en": "Excellence of spreading the Islamic greeting"
	},
	{
		"duas": [
			{
				"top_en": "\"When the people of the Book greet you, reply by saying:",
				"arabic": "وَعَلَيْكُمْ",
				"transliteration": "Wa 'alaykum",
				"translations_en": "And upon you.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 3/408, Muslim 2/841."
			}
		],
		"pageTitle_en": "Returning a greeting to a kaafir"
	},
	{
		"duas": [
			{
				"top_en": "\"If you hear the crow of a rooster, ask Allaah for his bounty for it has seen an angel and if you hear the braying of an ass, seek refuge in Allaah for it has seen a devil.\" [1] \n\nAlso\n\n\"If you hear the barking of dogs or the braying of asses at night, seek refuge in Allaah for they see what you do not.\" [2]",
				"arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيـمِ",
				"transliteration": "'A'oo<u>th</u>u billaahi minash-Shaytaanir-rajeem.",
				"translations_en": "I seek refuge in Allah from Satan the outcast.",
				"bottom_en": "",
				"reference_en": "[1] Al-Bukhari, Muslim 4/2092.\n[2] Abu Dawud 4/327, Ahmed 3/306"
			}
		],
		"pageTitle_en": "Upon hearing a rooster crow, ass bray or dogs barking"
	},
	{
		"duas": [
			{
				"top_en": "When night falls [i.e., at al-Maghrib] , restrain your children [from going out] because at such time the devils spread about. After a period of time has passed, let them be. Shut your doors and mention Allaah\"s name, for verily the devil does not open a shut door, tie up your water-skins and mention Allaah\"s name, cover your vessels with anything and mention Allaah\"s name and put out your lamps.'",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, Muslim 3/1595."
			}
		],
		"pageTitle_en": "Etiquette of retiring for the night"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ",
				"transliteration": "Allaahumma fa'ayyumaa mu'minin sababtuhu faj'al <u>th</u>aalika lahu qurbatan 'ilayka yawmal-qiyaamati.",
				"translations_en": "O Allah, whomever of the believers I have abused, give him the reward of a sacrificial slaughter for it on the Day of Resurrection.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 6/350, Muslim 4/2092."
			}
		],
		"pageTitle_en": "For one you have insulted"
	},
	{
		"duas": [
			{
				"top_en": "He (sal-Allaahu 'alayhe wa sallam) said: \"If anyone of you is impelled to praise his brother, then he should say:",
				"arabic": "",
				"transliteration": "",
				"translations_en": "I deem so-and-so to be...and Allaah is his reckoner...and I don\"t praise anyone, putting it [i.e., my praising] forward, in front of Allaah\"s commendation, however I assume him to be such and such\" - if he knows that of him.",
				"bottom_en": "",
				"reference_en": "Muslim 4/2296."
			}
		],
		"pageTitle_en": "Etiquette of praising a fellow Muslim"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ لاَ تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْ لِي مَا لاَ يَعْلَمُونَ، (وَاجْعَلْنِي خَيْراً مِمَّا يَظُّنُّونَ)",
				"transliteration": "Allaahumma laa tu'aakhithnee bimaa yaqooloona, waghfir lee maa laa ya'lamoona [waj'alnee khayram-mimmaa yadhunnoon.]",
				"translations_en": "Oh Allah, do not call me to account for what they say and forgive me for what they have no knowledge of [and make me better than they imagine]",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, Al Adab Al Mufrad No. 761. Al-Albani graded it sahih in Sahih Adabil Mufrad. Words between the brackets are from Baihaqi, 4/228"
			}
		],
		"pageTitle_en": "For the one that have been praised"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ",
				"transliteration": "Labbayk Allaahumma labbayk, labbayk laa shareeka laka labbayk, 'innal-hamda, wanni'mata, laka walmulk, laa shareeka laka.",
				"translations_en": "I am here at Your service, O Allah, I am here at Your service. I am here at Your service, You have no partener, I am here at Your service. Surely the praise, and blessings are Yours, and the dominion. You have no partener.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, Muslim 2/841."
			}
		],
		"pageTitle_en": "Pilgrim's arrival for Hajj/Umrah - Talbiya"
	},
	{
		"duas": [
			{
				"top_en": "\"The Prophet (sal-Allaahu 'alayhe wa sallam) circled the Ka'bah on a camel, every time he reached the black stone he would point to it with something (his staff) and say:",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar.",
				"translations_en": "Allah is the Most Great.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari,,cf. Al-Asqalani, Fathul-Bari 3/476. See also 472. The 'something' that was referred to in this Hadith was a cane."
			}
		],
		"pageTitle_en": "Takbir when passing the black stone"
	},
	{
		"duas": [
			{
				"top_en": "The Prophet (sal-Allaahu 'alayhe wa sallam) used to say between the Yemeni corner and the black stone:",
				"arabic": "رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ",
				"transliteration": "Rabbanaa 'aatinaa fid-dunyaa hasanatan wa fil-'aakhirati hasanatan wa qinaa 'a<u>th</u>aaban-naar.",
				"translations_en": "Our Lord, grant us the good things in this world and the good things in the next life and save us from the punishment of the Fire.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/171, Muslim 4/2007. The wording in Muslim's report is: 'make it a purification for him and a source of mercy."
			}
		],
		"pageTitle_en": "Between the Yemeni corner and black stone [Ka'bah]"
	},
	{
		"duas": [
			{
				"top_en": "Jaabir (radhi-yAllaahu 'anhu) said when describing the Prophet's (sal-Allaahu 'alayhe wa sallam) pilgrimage:\n\nWhen he approached mount as-Safaa he would recite:",
				"arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ،",
				"transliteration": "Inna assafa walmarwatamin shaAAa-iri Allahi",
				"translations_en": "Indeed, as-Safa and al-Marwah are among the symbols of Allah",
				"bottom_en": "Soorah al-Baqarah, Aayah 158",
				"reference_en": ""
			},
			{
				"top_en": "...and then say:",
				"arabic": "أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ",
				"transliteration": "Abda'u bimaa bada'allaahu bihi.",
				"translations_en": "I begin by that which Allah began.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "...so he started with as-Safaa and climbed it until he could see the Ka'bah, he then faced it and said:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu wa Huwa 'alaa kulli shay'in Qadeer, laa 'ilaaha 'illallaahu ilahaahu, 'anjaza wa'dahu, wa nasara 'abdahu, wa hazamal 'ahzaaba wahdahu.",
				"translations_en": "None has the right to be worshipped but Allah alone, Who has no partener, His is the dominion and His is the praise, and He is Able to do all things. None has the right to be worshipped but Allah alone, He fulfilled His Promise, He aided His slave, and He alone defeated Confederates.",
				"bottom_en": "Then he would ask Allah for what he liked, repeating the same thing like this three times. He did at Mount Marwah as he did at Mount Safa.",
				"reference_en": "Muslim 2/888."
			}
		],
		"pageTitle_en": "When at Mount Safa and Mount Marwah"
	},
	{
		"duas": [
			{
				"top_en": "\"The best of supplications is the supplication on the day of 'Arafah and the best which I and the Prophets before me have said is:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu wa Huwa 'alaa kulli shay'in Qadeer.",
				"translations_en": "None has the right to be worshipped but Allah alone, Who has no partener. His is the dominion and His is the praise, and He is Able to do all things.",
				"bottom_en": "",
				"reference_en": "At-Tirmithi. Al-Albani graded it good in Sahih At-Tirmithi 3/184, and also Silsilatul-'Ahadith As-Sahihah 4/6."
			}
		],
		"pageTitle_en": "The Day of 'Arafah"
	},
	{
		"duas": [
			{
				"top_en": "Jaabir (radhi-yAllaahu 'anhu) said: \"He (sal-Allaahu 'alayhe wa sallam) rode al-Qaswaa (prophet's camel) until he reached al-Mash'ar al-Haraam, he then faced the qiblah, supplicated to Allaah,",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar",
				"translations_en": "Allah is the Most Great.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "and extolled His greatness",
				"arabic": "لاَ إِلَهَ إِلاَّ اللّهُ",
				"transliteration": "Laa 'ilaaha 'illallaahu",
				"translations_en": "None has the right to be worshipped but Allah alone",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "and oneness.",
				"arabic": "اللَّهُ اَحَدٌ",
				"transliteration": "Allahu Ahad",
				"translations_en": "Allah is the one",
				"bottom_en": "He stood until the sun shone but left before it rose.\"",
				"reference_en": "Muslim 2/891 No. 1218"
			}
		],
		"pageTitle_en": "Sacred Site [al-Mash'ar al-Haraam] - At Muzdalifa"
	},
	{
		"duas": [
			{
				"top_en": "The Prophet (SAW) said:",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar",
				"translations_en": "Allah is the Most Great!",
				"bottom_en": "...with each pebble he threw at the three pillars. Then he went forward, stood facing the Qiblah and raised his hands and called upon Allah.\n\nThat was after (stoning) the first and second pillar. As for the third, he stoned it and called out Allaahu 'Akbar with every pebble he threw, but when he was finished he left without standing at it (for supplications).",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 3/581, 3, 4, and Muslim"
			}
		],
		"pageTitle_en": "When throwing each pebble at the Jamarat"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "سُبْحَانَ اللَّهِ",
				"transliteration": "Subhaanallaah!",
				"translations_en": "Glory is to Allah. [1]",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "اللَّهُ أَكْبَرُ",
				"transliteration": "Allaahu 'Akbar!",
				"translations_en": "Allah is the Most Great. [2]",
				"bottom_en": "",
				"reference_en": "[1] Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 1/210, 390, 414 and Muslim 4/1857.\n[2] Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 8/441. See also Al-Albani, Sahih At-Tirmithi 2/103, 235, Ahmad 5/218."
			}
		],
		"pageTitle_en": "At times of amazement and delight"
	},
	{
		"duas": [
			{
				"top_en": "The Prophet (sal-Allaahu 'alayhe wa sallam) would prostrate in gratitude to Allaah (Subhaanahu wa Ta'aala) upon receiving news which pleased him or which caused pleasure.",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": "Abu Dawud, Ibn Majah, At-Tirmithi. See also Al-Albani, Sahih Ibn Majah 1/233, and 'Irwa'ul-Ghalil 2/226."
			}
		],
		"pageTitle_en": "Upon receiving pleasant news"
	},
	{
		"duas": [
			{
				"top_en": "Place your hand at the site of the pain and say (three times):",
				"arabic": "بِسْمِ اللَّهِ",
				"transliteration": "Bismillaah.",
				"translations_en": "In the Name of Allah",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "Then say (seven times):",
				"arabic": "أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
				"transliteration": "A'oo<u>th</u>u billaahi wa qudratihi min sharri maa 'ajidu wa 'uhaa<u>th</u>iru.",
				"translations_en": "I seek refuge in Allah and in His Power from the evil of what I find and of what I guard against.",
				"bottom_en": "",
				"reference_en": "Muslim 4/1728."
			}
		],
		"pageTitle_en": "When feeling some pain in the body"
	},
	{
		"duas": [
			{
				"top_en": "If you see something from your brother, yourself or wealth which you find impressing, then invoke blessings for it, for the evil eye is indeed true'",
				"arabic": "بَارَكَ اللَّهُ لَك",
				"transliteration": "Allahumma baarik 'alayhi",
				"translations_en": "O Allah send blessings upon him",
				"bottom_en": "",
				"reference_en": "Ahmad 4/447, Ibn Majah, Malik. Al-Albani graded it authentic in Sahihul-Jami' As-Saghir 1/212. Also see Al-Arna'ut's checking of Ibn Al-Qayyim's Zadul-Ma'ad 4/170."
			}
		],
		"pageTitle_en": "When in fear of afflicting someone with one’s eye"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ",
				"transliteration": "Laa 'ilaaha 'illallaah!",
				"translations_en": "There is none worthy of worship but Allah!",
				"bottom_en": "",
				"reference_en": "Bukhari 6/361 No. 3346; Muslim 4/2208 No. 2880."
			}
		],
		"pageTitle_en": "When startled"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ وَلَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
				"transliteration": "Bismillaahi wallaahu 'Akbar [Allaahumma minka wa laka] Allaahumma taqabbal minnee.",
				"translations_en": "With the Name of Allah, Allah is the Most Great! [O Allah, from You and to You.] O Allah, accept it from me.",
				"bottom_en": "",
				"reference_en": "At-Tirmithi 5/82, Ahmad 4/400, Abu Dawud 4/ 308. See also Al-Albani, Sahih At-Tirmithi 2/354."
			}
		],
		"pageTitle_en": "When slaughtering or sacrificing an animal"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلاَّ طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
				"transliteration": "A'oo<u>th</u>u bikalimaatil-laahit-taammaatil-latee laa yujaawizuhunna barrun wa laa faajimn min sharri maa khalaqa, wa bara'a wa <u>th</u>ara'a, wa min sharri maa yanzilu minas-samaa'i, wa min sharri maa ya'ruju feehaa, wa min sharri maa <u>th</u>ara'a fil-'ardhi, wa min sharri ma yakhruju minhaa, wa min sharri fitanil-layli wannahaari, wa min sharri kulli taariqin 'illaa taariqan yatruqu bikhayrin yaa Rahmaan.",
				"translations_en": "\"I take refuge within Allaah\"s perfect words which no righteous or unrighteous person can transgress, from all the evil that He has created, made and originated. [I take refuge] from the evil that descends from the sky and the evil that rises up to it. [I take refuge] from the evil that is spread on earth and the evil that springs from her, and I take refuge from the evil of the tribulations of night and day, and the evil of one who visits at night except the one who brings good, O Merciful One.\"",
				"bottom_en": "",
				"reference_en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/42, Muslim 4/1705."
			}
		],
		"pageTitle_en": "To ward off the deception of the Obstinate Shaytans"
	},
	{
		"duas": [
			{
				"top_en": "\"The Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) said: \"By Allaah, I seek forgiveness and repent to Allaah, more than seventy times a day.\" [1] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"O People, Repent to Allaah! Verily I repent to Him a hundred times a day.\" [2] \n\n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"Whoever says:",
				"arabic": "أَسْتَغْفِرُ اللَّهَ الْعَظيمَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيهِ",
				"transliteration": "Astaghfirullaahal-'A<u>dh</u>eemal-la<u>th</u>ee laa 'ilaaha 'illaa Huwal-Hayyul-Qayyoomu wa 'atoobu 'ilayhi.",
				"translations_en": "\"I seek Allaah\"s forgiveness, besides whom, none has the right to be worshipped except He, The Ever Living, The Self-Subsisting and Supporter of all, and I turn to Him in repentance.\" [3]",
				"bottom_en": "...Allaah would forgive him even if he was one who fled during the advance of an army.\"\n\n\nHe (sal-Allaahu 'alayhe wa sallam) said: \"The nearest the Lord comes to His servant is in the middle of the night, so if you are able to be of those who remember Allaah at that time, then be so.\" [4] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"The nearest a servant is to his Lord is when he is prostrating, so supplicate much therein.\" [5] \n\nHe (sal-Allaahu 'alayhe wa sallam) also said: \"Verily my heart becomes preoccupied, and verily I seek Allaah\"s forgiveness a hundred times a day.\" [6] \n\nHe also said: The most superior way of asking for forgiveness from Allah is to say the Sayyidinal Istighfar.\nFor this, go to Dua 27.6 [7]",
				"reference_en": "[1] Al-Bukhari, cf. Al-Asqalani, Fathul-BAri 11/101 No. 6307\n[2] Muslim 4/2076 No. 2702\n[3] Abu Dawud 2/85, At-Tirmithi 5/569, and Al-Hakim who declared it authentic and Ath-Thahabi agreed with him 1/511. Al-Albani graded it authentic in Sahih At-Tirmithi 3/182. See also Jami'ul-'Usool li-'Ahdaith Ar-Rasool 4/ 389-90 checked by Al-Arna'ut.\n[4] At-Tirmithi, An-Nasa'i 1/279 and Al-Hakim. See also Al-Albani, Sahih At-Tirmithi 3/183, and Jdmi'ul-'Usool with Al-Arna'ut's checking 4/144.\n[5] Muslim 1/350.\n[6] Muslim 4/2075 No. 2702\n[7] Al-Bukhari 7/150"
			}
		],
		"pageTitle_en": "Seeking Forgiveness & Repentance"
	},
	{
		"duas": [
			{
				"top_en": "Whoever says:",
				"arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
				"transliteration": "Subhaanallaahi wa bihamdihi.",
				"translations_en": "Glorified is Allah and praised is He.",
				"bottom_en": "...one hundred times a day, will have his sins forgiven even if they are like the foam of the sea.",
				"reference_en": "Al-Bukhari 7/168, Muslim 4/2071"
			}
		],
		"pageTitle_en": "Sins forgiven even if like the foam of the sea"
	},
	{
		"duas": [
			{
				"top_en": "Abu Ayyoob al-Ansaaree (radhi-yAllaahu 'anhu) related that The Prophet (sal-Allaahu 'alayhe wa sallam) said:\n\nWhoever says:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, lahul-mulku wa lahul-hamdu wa Huwa 'alaa kulli shay'in Qadeer.",
				"translations_en": "None has the right to be worshipped except Allaah, alone, without any partener. To Him belong all sovereignty and praise and He is over all things omnipotent.",
				"bottom_en": "...ten times, is like one who has freed four souls from among the children of Ismaa'eel.",
				"reference_en": "Al-Bukhari 7/67, Muslim 4/2071"
			}
		],
		"pageTitle_en": "Reward of Freeing four slaves"
	},
	{
		"duas": [
			{
				"top_en": "Abu Hurayrah (radhi-yAllaahu 'anhu) reported that the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) said:\n\n [There are] Two words, [which are] light on the tongue, heavy on the Scale and beloved to The Most Gracious:",
				"arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحانَ اللَّهِ الْعَظِيمِ",
				"transliteration": "Subhaanal-laahi wa bihamdihi, Subhaanal-laahil-'Adheem.",
				"translations_en": "How perfect Allaah is and I praise Him. How perfect Allaah is, The Supreme.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari 7/168, Muslim 4/2072"
			}
		],
		"pageTitle_en": "Words Light on tongue, Heavy on the balance"
	},
	{
		"duas": [
			{
				"top_en": "Abu Hurayrah (radhi-yAllaahu 'anhu) reported that the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) said: Saying:",
				"arabic": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ",
				"transliteration": "Subhaanallaah, Alhamdu lillaah, Laa 'ilaaha 'illallaah, wa Allaahu 'Akbar",
				"translations_en": "How perfect Allaah is, and all praise is for Allaah. None has the right to be worshipped except Allaah, and Allaah is the greatest.",
				"bottom_en": "...is more beloved to me than everything the sun has risen over.\n\nThe most beloved words to Allaah are also these four, and it does not matter which of them you start with.",
				"reference_en": "Muslim 3/1685.   Muslim 4/2072"
			}
		],
		"pageTitle_en": "Most beloved words to Allah"
	},
	{
		"duas": [
			{
				"top_en": "Sa'd (radhi-yAllaahu 'anhu) said: We were sitting with the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam), and he said:\n\nAre any of you unable to gain a thousand good deeds each day?\n\nSomebody then asked him (sal-Allaahu 'alayhe wa sallam):\nHow does one achieve a thousand good deeds?\n\nHe replied: He should say:",
				"arabic": "سُبْحَانَ اللَّهِ",
				"transliteration": "Subhaanallaahi.",
				"translations_en": "How perfect Allaah is.",
				"bottom_en": "...one hundred times, for a thousand good deeds are recorded for him or a thousand bad deeds are wiped away.",
				"reference_en": "Muslim 4/2073"
			}
		],
		"pageTitle_en": "1000 Rewards written, 1000 Sins wiped away"
	},
	{
		"duas": [
			{
				"top_en": "Jaabir (radhi-yAllaahu 'anhu) related that The Prophet (sal-Allaahu 'alayhe wa sallam) said:\n\nWhoever says:",
				"arabic": "سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ",
				"transliteration": "Subhaanallaahil-'Adheemi wa bihamdihi.",
				"translations_en": "How perfect Allaah is, The Supreme, and I praise Him.",
				"bottom_en": "...a palm tree is planted for him in Paradise.",
				"reference_en": "At-Tirmizi 5/511, Al-Hakim"
			}
		],
		"pageTitle_en": "Date palm planted in Paradise"
	},
	{
		"duas": [
			{
				"top_en": "Adbullaah Ibn Qays (radhi-yAllaahu 'anhu) related that The Prophet (sal-Allaahu 'alayhe wa sallam) said to him:\n\nO 'Adbullaah Ibn Qays, shall I not inform you of a treasure from the treasures of paradise?\n\nHe (sal-Allaahu 'alayhe wa sallam) then said: Say:",
				"arabic": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
				"transliteration": "Laa hawla wa laa quwwata 'illaa billaah.",
				"translations_en": "There is no might nor power except with Allaah.",
				"bottom_en": "",
				"reference_en": "Al-Bukhari , Muslim 4/2076"
			}
		],
		"pageTitle_en": "Treasure of Paradise"
	},
	{
		"duas": [
			{
				"top_en": "Sa'd Ibn Abee Waqqaas (radhi-yAllaahu 'anhu) narrated that a man came to the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) and said to him:\n\nTeach me something which I should say?\n\nHe (sal-Allaahu 'alayhe wa sallam) said: Say:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثِيراً، سُبْحَانَ اللَّهِ رَبِّ العَالَمِينَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَزِيزِ الْحَكِيمِ",
				"transliteration": "Laa 'ilaaha 'illallaahu wahdahu laa shareeka lahu, Allaahu 'Akbaru kabeeran, walhamdu lillaahi katheeran, Subhaanallaahi Rabbil-'aalameen, laa hawla wa laa quwwata 'illaa biilaahil-'Azeezil-Hakeem.",
				"translations_en": "None has the right to be worshipped except Allaah, alone without any partener. Allaah is most great and much praise is for Allaah. How perfect Allaah is, Lord of the worlds. There is no might nor power except with Allaah, The Exalted in might, The Wise.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "...the man then said: These are for my Lord, and what is for me? He (sal-Allaahu 'alayhe wa sallam) replied: Say:",
				"arabic": "اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي",
				"transliteration": "Allaahummaghfir lee, warhamnee, wahdinee, wa 'aafinee warzuqnee.",
				"translations_en": "O Allaah, forgive me, have mercy upon me, guide me and grant me sustenance.",
				"bottom_en": "",
				"reference_en": "Muslim 4/2072"
			}
		],
		"pageTitle_en": "Excellence of Zikr & glorification of Allaah #8"
	},
	{
		"duas": [
			{
				"top_en": "Taariq al-Ashja'ee (radhi-yAllaahu 'anhu) said: When someone would embrace Islaam, The Prophet (sal-Allaahu 'alayhe wa sallam) would teach him how to perform prayer and then order him to supplicate with the following words:",
				"arabic": "اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي",
				"transliteration": "Allaahummaghfir lee, warhamnee, wahdinee, wa 'aafinee warzuqnee.",
				"translations_en": "O Allaah, forgive me, have mercy upon me, guide me, give me health and grant me sustenance.",
				"bottom_en": "",
				"reference_en": "Muslim 4/2073"
			}
		],
		"pageTitle_en": "Excellence of Zikr & glorification of Allaah #9"
	},
	{
		"duas": [
			{
				"top_en": "Jaabir Ibn 'Adbullaah (radhi-yAllaahu 'anhu) related that the Messenger of Allaah (sal-Allaahu 'alayhe wa sallam) said:\n\nVerily, the best supplication is:",
				"arabic": "الْحَمْدُ لِلَّهِ",
				"transliteration": "Alhamdu lillaah.",
				"translations_en": "All praise is for Allaah.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "...and indeed, the best form of remembrance is:",
				"arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ",
				"transliteration": "Laa'ilaaha'illallaah.",
				"translations_en": "None has the right to be worshipped except Allaah.",
				"bottom_en": "",
				"reference_en": "At-Tirmizi 5/462, Ibn Majah 2/1249, Al-Hakim"
			}
		],
		"pageTitle_en": "Best Supplication & Best Remembrance"
	},
	{
		"duas": [
			{
				"top_en": "The good deeds which endure are:",
				"arabic": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
				"transliteration": "Subhaanallaah, Alhamdu lillaah, Laa 'ilaaha 'illallaah, wa Allaahu 'Akbar, Laa hawla wa laa quwwata 'illaa billaah.",
				"translations_en": "How perfect Allaah is, and all praise is for Allaah. None has the right to be worshipped except Allaah, and Allaah is the greatest. There is no might nor power except with Allaah.",
				"bottom_en": "",
				"reference_en": "Ahmad (no. 513) (Ahmad Shakir, ed.) and its chain of narration is authentic. See Majma'uz-Zawa'id 1/297. Ibn Hajar mentions it in Bulughul-Maram saying that Ibn Hibban and Al-Hakim considered it authentic."
			}
		],
		"pageTitle_en": "Good deeds which endure"
	},
	{
		"duas": [
			{
				"top_en": "Adbullaah Ibn 'Amr (radhi-yAllaahu 'anhu) said:\n\n\"I saw The Prophet (sal-Allaahu 'alayhe wa sallam) make tasbeeh with his right hand.\"",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": "Abu Dawud, At-Tirmizi 5/521"
			}
		],
		"pageTitle_en": "How the Prophet (saws) made tasbeeh"
	},
	{
		"duas": [
			{
				"top_en": "O Allaah, send peace and blessings upon our Prophet Muhammad, his companions, and his family and all those who follow them in righteousness till the Day of Reckoning.\n\nAameen",
				"arabic": "",
				"transliteration": "",
				"translations_en": "",
				"bottom_en": "",
				"reference_en": ""
			}
		],
		"pageTitle_en": "General and Beneficent rules"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ",
				"transliteration": "Bismillaahir Rahmaanir Raheem",
				"translations_en": "In the name of Allah , the Entirely Merciful, the Especially Merciful.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
				"transliteration": "Alhamdu lillaahi Rabbil 'aalameen",
				"translations_en": "[All] praise is [due] to Allah , Lord of the worlds -",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "الرَّحْمَنِ الرَّحِيمِ",
				"transliteration": "Ar-Rahmaanir-Raheem",
				"translations_en": "The Entirely Merciful, the Especially Merciful,",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "مَالِكِ يَوْمِ الدِّينِ",
				"transliteration": "Maaliki Yawmid-Deen",
				"translations_en": "Sovereign of the Day of Recompense.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
				"transliteration": "Iyyaaka na'budu wa lyyaaka nasta'een",
				"translations_en": "It is You we worship and You we ask for help.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
				"transliteration": "Ihdinas-Siraatal-Mustaqeem",
				"translations_en": "Guide us to the straight path -",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
				"transliteration": "Siraatal-lazeena an'amta 'alaihim ghayril-maghdoobi 'alaihim wa lad-daaalleen",
				"translations_en": "The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.",
				"bottom_en": "",
				"reference_en": "Surah Fatiha 1:1-7"
			}
		],
		"pageTitle_en": "Surah Fatiha 1:1-7"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَعُوذُ بِاللَّهِ أَنْ أَكُونَ مِنَ الْجَاهِلِينَ",
				"transliteration": "AAoothu biAllahi an akoona mina aljahileen",
				"translations_en": "I seek refuge in Allah from being among the ignorant.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah - 2:67"
			}
		],
		"pageTitle_en": "Protecton from being ignorant [2:67]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ ٱجْعَلْ هَٰذَا بَلَدًا ءَامِنًا وَٱرْزُقْ أَهْلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنْ ءَامَنَ مِنْهُم بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۖ",
				"transliteration": "rabbi ijAAal hatha baladan aminan warzuqahlahu mina aththamarati man amana minhumbillahi walyawmi al-akhiri",
				"translations_en": "My Lord, make this a secure city and provide its people with fruits - whoever of them believes in Allah and the Last Day.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah - 2:126"
			}
		],
		"pageTitle_en": "Surah Al-Baqarah - 2:126"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ العَلِيمُ",
				"transliteration": "Rabbana taqabbal minna innaka antas Sameeaul Aleem",
				"translations_en": "Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
				"transliteration": "Rabbana wa-j'alna Muslimayni laka wa min Dhurriyatina 'Ummatan Muslimatan laka wa 'Arina Manasikana wa tub 'alayna 'innaka 'antat-Tawwabu-Raheem",
				"translations_en": "Our Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah - 2:127-128"
			}
		],
		"pageTitle_en": "Seeking acceptance of deeds &  becoming a devout muslim [2:127-128]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
				"transliteration": "Rabbana aatina fiddunya hasanatan wa fil aakhirati hasanatan waqina azaabannaar",
				"translations_en": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah 2:201"
			}
		],
		"pageTitle_en": "Seeking good of this world and the hereafter [2:201]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
				"transliteration": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin",
				"translations_en": "Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah - 2:250"
			}
		],
		"pageTitle_en": "Seeking patience, firmness and victory [2:250]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ",
				"transliteration": "samiAAna waataAAna ghufranakarabbana wa-ilayka almaseer",
				"translations_en": "We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah 2:285"
			}
		],
		"pageTitle_en": "Surah Al-Baqarah 2:285"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
				"transliteration": "rabbana latu-akhithna in naseena aw akhta/narabbana wala tahmil AAalayna isrankama hamaltahu AAala allatheena minqablina rabbana wala tuhammilnama la taqata lana bihi waAAfuAAanna waghfir lana warhamnaanta mawlana fansurna AAalaalqawmi alkafireen",
				"translations_en": "Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
				"bottom_en": "",
				"reference_en": "Surah Al-Baqarah 2:286"
			}
		],
		"pageTitle_en": "Surah Al-Baqarah 2:286"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
				"transliteration": "Rabbana la tuzigh quloobana ba'da idh hadaytana wa hab lana milladunka rahmah innaka antal Wahhab",
				"translations_en": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
				"transliteration": "Rabbana innaka jamiAAu annasiliyawmin la rayba feehi inna Allaha layukhlifu almeeAAad",
				"translations_en": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:8-9"
			}
		],
		"pageTitle_en": "Protection from deviation after guidance [3:8-9]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
				"transliteration": "Rabbana innana amanna faghfir lana dhunuubana wa qinna 'adhaban-Naar",
				"translations_en": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:16"
			}
		],
		"pageTitle_en": "Asking forgiveness and protection from hell [3:16]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
				"transliteration": "Rabbi hab lee min ladunka thurriyyatan tayyibatan innaka samee ud duaa",
				"translations_en": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:38"
			}
		],
		"pageTitle_en": "Asking for a good child [3:38]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَِ",
				"transliteration": "Rabbana amanna bima anzalta wattaba 'nar-Rusula fak-tubna ma'ash-Shahideen",
				"translations_en": "Our Lord, we have believed in what You revealed and have followed the messenger Jesus, so register us among the witnesses [to truth].",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:53"
			}
		],
		"pageTitle_en": "Surah Al-Imran - 3:53"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ",
				"transliteration": "Rabbana-ghfir lana dhunuubana wa israfana fi amrina wa thabbit aqdamana wansurna 'alal qawmil kafireen",
				"translations_en": "Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:147"
			}
		],
		"pageTitle_en": "Seeking forgiveness, firmness and victory [3:147]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
				"transliteration": "Rabbana ma khalaqta hadha batila Subhanaka faqina 'adhaban-Naar",
				"translations_en": "Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ",
				"transliteration": "Rabbana innaka man tudkhilin nara faqad akhzaytah wa ma liDh-dhalimeena min ansar",
				"translations_en": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ",
				"transliteration": "Rabbana innana samiAAnamunadiyan yunadee lil-eemani an aminoobirabbikum faamanna rabbana faghfirlana thunoobana wakaffir AAannasayyi-atina watawaffana maAAa al-abrar",
				"translations_en": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
				"transliteration": "Rabbana waatina mawaAAadtana AAala rusulika wala tukhzinayawma alqiyamati innaka la tukhlifu almeeAAad",
				"translations_en": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.",
				"bottom_en": "",
				"reference_en": "Surah Al-Imran - 3:191-194"
			}
		],
		"pageTitle_en": "Surah Al-Imran - 3:191-194"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيًّا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيرًا",
				"transliteration": "rabbana akhrijna min hathihialqaryati aththalimi ahluhawajAAal lana min ladunka waliyyan wajAAallana min ladunka naseera",
				"translations_en": "Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?",
				"bottom_en": "",
				"reference_en": "Surah An-Nisa - 4:75"
			}
		],
		"pageTitle_en": "Dua of an oppressed person[4:75]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي ۖ فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ",
				"transliteration": "rabbi innee la amliku illanafsee waakhee fafruq baynana wabayna alqawmi alfasiqeen",
				"translations_en": "\"My Lord, indeed I do not possess except myself and my brother, so part us from the defiantly disobedient people.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Ma'idah - 5:25"
			}
		],
		"pageTitle_en": "Surah Al-Ma'ida - 5:25"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
				"transliteration": "Rabbana aamana faktubna ma' ash-shahideen",
				"translations_en": "Our Lord, we have believed, so register us among the witnesses.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَمَا لَنَا لَا نُؤْمِنُ بِاللَّهِ وَمَا جَاءَنَا مِنَ الْحَقِّ وَنَطْمَعُ أَن يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصَّالِحِينَ",
				"transliteration": "Wama lana la nu/minu billahiwama jaana mina alhaqqi wanatmaAAuan yudkhilana rabbuna maAAa alqawmi assaliheen",
				"translations_en": "And why should we not believe in Allah and what has come to us of the truth? And we aspire that our Lord will admit us [to Paradise] with the righteous people.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Ma'idah - 5:83-84"
			}
		],
		"pageTitle_en": "Surah Al-Ma'ida - 5:83-84"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ",
				"transliteration": "Rabbana anzil 'alayna ma'idatam minas-Samai tuknu lana 'idal li-awwa-lina wa aakhirna wa ayatam-minka war-zuqna wa anta Khayrul-Raziqeen",
				"translations_en": "O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers.",
				"bottom_en": "",
				"reference_en": "Surah Al-Ma'ida - 5:114"
			}
		],
		"pageTitle_en": "Surah Al-Ma'ida - 5:114"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
				"transliteration": "Rabbana zalamna anfusina wa il lam taghfir lana wa tarhamna lana kunan minal-khasireen",
				"translations_en": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:23"
			}
		],
		"pageTitle_en": "Seeking forgiveness and mercy after sinning [7:23]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
				"transliteration": "Rabbana la taj'alna ma'al qawwmi-dhalimeen",
				"translations_en": "Our Lord, do not place us with the wrongdoing people.",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:47"
			}
		],
		"pageTitle_en": "Dua for not placing among wrongdoers [7:47]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
				"transliteration": "AAala Allahi tawakkalna rabbanaiftah baynana wabayna qawmina bilhaqqiwaanta khayru alfatiheen",
				"translations_en": "Upon Allah we have relied. Our Lord, decide between us and our people in truth, and You are the best of those who give decision.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:89"
			}
		],
		"pageTitle_en": "Surah Al-A'raf - 7:89"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
				"transliteration": "Rabbana afrigh 'alayna sabraw wa tawaffana Muslimeen",
				"translations_en": "Our Lord, pour upon us patience and let us die as Muslims [in submission to You].",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:126"
			}
		],
		"pageTitle_en": "Seeking patience and dying as a muslim [7:126]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ",
				"transliteration": "Rabbi ighfir lee wali akhee wa adkhilna fee rahmatika wa anta arhamur rahimeen",
				"translations_en": "My Lord, forgive me and my brother and admit us into Your mercy, for You are the most merciful of the merciful.",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:151"
			}
		],
		"pageTitle_en": "Seeking forgiveness and mercy [7:151]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُم مِّن قَبْلُ وَإِيَّايَ ۖ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا ۖ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَن تَشَاءُ وَتَهْدِي مَن تَشَاءُ ۖ أَنتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنتَ خَيْرُ الْغَافِرِينَ",
				"transliteration": "rabbi lawshi/ta ahlaktahum min qablu wa-iyyaya atuhlikunabima faAAala assufahao minna in hiyailla fitnatuka tudillu biha man tashaowatahdee man tashao anta waliyyuna faghfirlana warhamna waanta khayru alghafireen",
				"translations_en": "\"My Lord, if You had willed, You could have destroyed them before and me [as well]. Would You destroy us for what the foolish among us have done? This is not but Your trial by which You send astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ",
				"transliteration": "Waktub lana fee hathihi ddunya hasanatan wafee al-akhiratiinna hudna ilayk",
				"translations_en": "And decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:155-156"
			}
		],
		"pageTitle_en": "Surah Al-A'raf - 7:155-156"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لَئِنْ آتَيْتَنَا صَالِحًا لَّنَكُونَنَّ مِنَ الشَّاكِرِينَ",
				"transliteration": "la-in ataytanasalihan lanakoonanna mina ashshakireen",
				"translations_en": "\"If You should give us a good [child], we will surely be among the grateful.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-A'raf - 7:189"
			}
		],
		"pageTitle_en": "Surah Al-A'raf - 7:189"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لَئِنْ أَنجَيْتَنَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ",
				"transliteration": "la-in anjaytana min hathihi lanakoonanna mina ashshakireen",
				"translations_en": "\"If You should save us from this, we will surely be among the thankful.\"",
				"bottom_en": "",
				"reference_en": "Surah Yunus - 10:22"
			}
		],
		"pageTitle_en": "Surah Yunus - 10:22"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ",
				"transliteration": "Alal Allahi thawakkalna rabbana la taj'alna fitnatal lil-qawmidh-Dhalimeen.",
				"translations_en": "Upon Allah do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
				"transliteration": "Wa najjina bi-Rahmatika minal qawmil kafireen.",
				"translations_en": "And save us by Your mercy from the disbelieving people.",
				"bottom_en": "",
				"reference_en": "Surah Yunus - 10:85-86"
			}
		],
		"pageTitle_en": "Surah Yunus - 10:85-86"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا إِنَّكَ آتَيْتَ فِرْعَوْنَ وَمَلَأَهُ زِينَةً وَأَمْوَالًا فِي الْحَيَاةِ الدُّنْيَا رَبَّنَا لِيُضِلُّوا عَن سَبِيلِكَ ۖ رَبَّنَا اطْمِسْ عَلَىٰ أَمْوَالِهِمْ وَاشْدُدْ عَلَىٰ قُلُوبِهِمْ فَلَا يُؤْمِنُوا حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ",
				"transliteration": "rabbanainnaka atayta firAAawna wamalaahu zeenatan waamwalanfee alhayati addunya rabbanaliyudilloo AAan sabeelika rabbana itmis AAalaamwalihim washdud AAala quloobihim falayu/minoo hatta yarawoo alAAathaba al-aleem",
				"translations_en": "\"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"",
				"bottom_en": "",
				"reference_en": "Surah Yunus - 10:88"
			}
		],
		"pageTitle_en": "Surah Yunus - 10:88"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "بِسْمِ ٱللَّهِ مَجْر۪ىٰهَا وَمُرْسَىٰهَآۚ إِنَّ رَبِّى لَغَفُورٌ رَّحِيمٌ",
				"transliteration": "bismillahi majre-ha wa mursa-ha, inna rabbi lagafu-rur ra'heem",
				"translations_en": "in the name of Allah is its course and its anchorage. Indeed, my Lord is Forgiving and Merciful.\"",
				"bottom_en": "",
				"reference_en": "Surah Hud - 11:41"
			}
		],
		"pageTitle_en": "Surah Hud - 11:41"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ",
				"transliteration": "Rabbi innee aoothu bika an as alaka ma laysa lee bihi ilmun wa illa taghfir lee wa tarhamnee akun minal khasireen",
				"translations_en": "My Lord, I seek refuge in You from asking that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.",
				"bottom_en": "",
				"reference_en": "Surah Hud - 11:47"
			}
		],
		"pageTitle_en": "Surah Hud - 11:47"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "مَعَاذَ اللَّهِ ۖ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ",
				"transliteration": "maAAatha Allahi innahu rabbee ahsanamathwaya innahu la yuflihu aththalimoon",
				"translations_en": "\"[I seek] the refuge of Allah . Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed.\"",
				"bottom_en": "",
				"reference_en": "Surah Yusuf - 12:23"
			}
		],
		"pageTitle_en": "Surah Yusuf - 12:23"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ ٱلسِّجْنُ أَحَبُّ إِلَىَّ مِمَّا يَدْعُونَنِىٓ إِلَيْهِ ۖ وَإِلَّا تَصْرِفْ عَنِّى كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ ٱلْجَٰهِلِينَ",
				"transliteration": "rabbi assijnu ahabbuilayya mimma yadAAoonanee ilayhi wa-illa tasrifAAannee kaydahunna asbu ilayhinna waakun mina aljahileen",
				"translations_en": "My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant.",
				"bottom_en": "",
				"reference_en": "Surah Yusuf - 12:33"
			}
		],
		"pageTitle_en": "Surah Yusuf - 12:33"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
				"transliteration": "Rabbi qad ataytanee mina almulkiwaAAallamtanee min ta/weeli al-ahadeethi fatira assamawatiwal-ardi anta waliyyee fee addunyawal-akhirati tawaffanee musliman waalhiqneebissaliheen",
				"translations_en": "My Lord, You have given me [something] of sovereignty and taught me of the interpretation of dreams. Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous.\"",
				"bottom_en": "",
				"reference_en": "Surah Yusuf - 12:101"
			}
		],
		"pageTitle_en": "Seeking death among the righteous muslims [12:101]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ",
				"transliteration": "rabbi ijAAal hatha albalada aminan wajnubneewabaniyya an naAAbuda al-asnam",
				"translations_en": "My Lord, make this city [Makkah] secure and keep me and my sons away from worshipping idols.",
				"bottom_en": "",
				"reference_en": "Surah Ibraheem - 14:35"
			}
		],
		"pageTitle_en": "Surah Ibraheem - 14:35"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
				"transliteration": "Rabbij alnee muqeemas salaati wa min thurriyyatee rabbana wa taqabbal duaa",
				"translations_en": "My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
				"transliteration": "Rabbana ghfir li wa li wallidayya wa lil Mu'mineena yawma yaqumul hisaab",
				"translations_en": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
				"bottom_en": "",
				"reference_en": "Surah Ibraheem - 14:40-41"
			}
		],
		"pageTitle_en": "Surah Ibraheem - 14:40-41"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
				"transliteration": "Rabbi  irhamhuma kama rabbayani sagheera",
				"translations_en": "My Lord, have mercy upon them as they brought me up [when I was] small.",
				"bottom_en": "",
				"reference_en": "Surah Al-Isra - 17:24"
			}
		],
		"pageTitle_en": "Dua for parents [17:24]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
				"transliteration": "Waqul rabbi adkhilnee mudkhala sidqinwaakhrijnee mukhraja sidqin wajAAal lee minladunka sultanan naseera",
				"translations_en": "My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority.",
				"bottom_en": "",
				"reference_en": "Surah Al-Isra - 17:80"
			}
		],
		"pageTitle_en": "Surah Al-Isra - 17:80"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
				"transliteration": "Rabbana 'atina mil-ladunka Rahmataw wa hayyi lana min amrina rashada",
				"translations_en": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.",
				"bottom_en": "",
				"reference_en": "Surah Al-Kahf - 18:10"
			}
		],
		"pageTitle_en": "Asking for correcting affairs and mercy[18:10]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيًّا",
				"transliteration": "rabbi innee wahana alAAathmuminnee washtaAAala arra/su shayban walam akunbiduAAa-ika rabbi shaqiyya",
				"translations_en": "\"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَإِنِّي خِفْتُ الْمَوَالِيَ مِن وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِرًا فَهَبْ لِي مِن لَّدُنكَ وَلِيًّا",
				"transliteration": "Wa-innee khiftu almawaliya min wara-eewakanati imraatee AAaqiran fahab lee min ladunkawaliyya",
				"translations_en": "And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ ۖ وَاجْعَلْهُ رَبِّ رَضِيًّا",
				"transliteration": "Yarithunee wayarithu min ali yaAAqoobawajAAalhu rabbi radiyya",
				"translations_en": "Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"",
				"bottom_en": "",
				"reference_en": "Surah Maryam - 19:4-6"
			}
		],
		"pageTitle_en": "Surah Maryam - 19:4-6"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "إِنِّي أَعُوذُ بِالرَّحْمَٰنِ مِنكَ إِن كُنتَ تَقِيًّا",
				"transliteration": "innee aAAoothu birrahmaniminka in kunta taqiyya",
				"translations_en": "\"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah .\"",
				"bottom_en": "",
				"reference_en": "Surah Maryam - 19:18"
			}
		],
		"pageTitle_en": "Surah Maryam - 19:18"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ اشْرَحْ لِي صَدْرِي",
				"transliteration": "Rabbi ishrah lee sadree",
				"translations_en": "My Lord, expand for me my breast [with assurance]",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَيَسِّرْ لِي أَمْرِي",
				"transliteration": "Wayassir lee amree",
				"translations_en": "And ease for me my task",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي",
				"transliteration": "Wahlul AAuqdatan min lisanee",
				"translations_en": "And untie the knot from my tongue",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "يَفْقَهُوا قَوْلِي",
				"transliteration": "Yafqahoo qawlee",
				"translations_en": "That they may understand my speech.",
				"bottom_en": "",
				"reference_en": "Surah Ta'ha - 20:25-28"
			}
		],
		"pageTitle_en": "Seeking easeness in speech [20:25-28]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ زِدْنِى عِلْمًا",
				"transliteration": "rabbizidnee AAilma",
				"translations_en": "My Lord, increase me in knowledge",
				"bottom_en": "",
				"reference_en": "Surah Ta'ha - 20:114"
			}
		],
		"pageTitle_en": "Asking for increase in knowledge [20:114]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
				"transliteration": "annee massaniya addurru waanta arhamuarrahimeen",
				"translations_en": "\"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Anbiya - 21:83"
			}
		],
		"pageTitle_en": "Surah Al-Anbiya - 21:83"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
				"transliteration": "la ilaha illa anta subhanaka inneekuntu mina aththalimeen",
				"translations_en": "\"There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Anbiya - 21:87"
			}
		],
		"pageTitle_en": "Surah Al-Anbiya - 21:87"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
				"transliteration": "Rabbi la tatharnee fardan waanta khayru alwaritheen",
				"translations_en": "My Lord, do not leave me alone [with no heir], while you are the best of inheritors",
				"bottom_en": "",
				"reference_en": "Surah Al-Anbiya - 21:89"
			}
		],
		"pageTitle_en": "Surah Al-Anbiya - 21:89"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ احْكُم بِالْحَقِّ ۗ وَرَبُّنَا الرَّحْمَٰنُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ",
				"transliteration": "Rabbi ohkum bilhaqqi wa rabbuna arrahmanul musta'aanu alaa ma tasifoon",
				"translations_en": "My Lord, judge [between us] in truth. And our Lord is the Most Merciful, the one whose help is sought against that which you describe.",
				"bottom_en": "",
				"reference_en": "Surah Al-Anbiya - 21:112"
			}
		],
		"pageTitle_en": "Surah Al-Anbiya - 21:112"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ انصُرْنِي بِمَا كَذَّبُونِ",
				"transliteration": "rabbi onsurnee bimakaththaboon",
				"translations_en": "\"My Lord, support me because they have denied me.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:26, 39"
			}
		],
		"pageTitle_en": "Surah Al-Mu'minoon - 23:26, 39"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ",
				"transliteration": "Rabbi anzilnee munzalan mubarakanwaanta khayru almunzileen",
				"translations_en": "My Lord, let me land at a blessed landing place, and You are the best to accommodate [us].",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:29"
			}
		],
		"pageTitle_en": "Surah Al-Mu'minoon - 23:29"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ",
				"transliteration": "Rabbi fala tajAAalnee fee alqawmi aththalimeen",
				"translations_en": "My Lord, then do not place me among the wrongdoing people.",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:94"
			}
		],
		"pageTitle_en": "Dua for not placing among wrongdoers [23:94]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ",
				"transliteration": "Rabbi aoothu bika min hamazatish shayateen",
				"translations_en": "My Lord, I seek refuge in You from the incitements of the devils",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
				"transliteration": "Wa aoothu bika rabbi an yahduroon",
				"translations_en": "And I seek refuge in You, my Lord, lest they be present with me.",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:97-98"
			}
		],
		"pageTitle_en": "Seeking refuge in Allah from devils [23:97-98]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ",
				"transliteration": "Rabbana amanna faghfir lana warhamna wa anta khayrur Rahimiin",
				"translations_en": "Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:109"
			}
		],
		"pageTitle_en": "Seeking forgiveness and mercy [23:109]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ",
				"transliteration": "Rabbi ighfir warhamwaanta khayru arrahimeen",
				"translations_en": "My Lord, forgive and have mercy, and You are the best of the merciful.",
				"bottom_en": "",
				"reference_en": "Surah Al-Mu'minoon - 23:118"
			}
		],
		"pageTitle_en": "Seeking forgiveness and mercy [23:118]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
				"transliteration": "Rabbanas-rif 'anna 'adhaba jahannama inna 'adhabaha kana gharama",
				"translations_en": "Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;",
				"bottom_en": "",
				"reference_en": "Surah Al-Furqan - 25:65"
			}
		],
		"pageTitle_en": "Seeking refuge froom the punishment from hellfire [25:65]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
				"transliteration": "Rabbana Hablana min azwaajina wadhurriy-yatina, qurrata 'ayioni wa-jalna lil-muttaqeena Imaama",
				"translations_en": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.",
				"bottom_en": "",
				"reference_en": "Surah Al-Furqan - 25:74"
			}
		],
		"pageTitle_en": "Asking coolness of eyes from family and becoming example for the righteous [25:74]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
				"transliteration": "Rabbi hab lee hukman wa alhiqnee bis saliheen.",
				"translations_en": "My Lord, grant me authority and join me with the righteous.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ",
				"transliteration": "Waj'al lee lisana sidqin fil akhireen.",
				"translations_en": "And grant me a reputation of honor among later generations.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ",
				"transliteration": "Waj'al nee min warathati jannatin na'eem.",
				"translations_en": "And place me among the inheritors of the Garden of Pleasure.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ",
				"transliteration": "Waghfir li-abee innahu kanamina addalleen.",
				"translations_en": "And forgive my father. Indeed, he has been of those astray.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ",
				"transliteration": "Wala tukhzinee yawma yub'asoon.",
				"translations_en": "And do not disgrace me on the Day they are [all] resurrected -",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ",
				"transliteration": "Yawma la yanfa'u malun walaa banoon.",
				"translations_en": "The Day when there will not benefit [anyone] wealth or children",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ",
				"transliteration": "Illa man ata Allah bi qalbin saleem.",
				"translations_en": "But only one who comes to Allah with a sound heart.",
				"bottom_en": "",
				"reference_en": "Surah Ash-Shu'araa - 26:83-89"
			}
		],
		"pageTitle_en": "Surah Ash-Shu'araa - 26:83-89"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنَّ قَوْمِي كَذَّبُونِ",
				"transliteration": "rabbi inna qawmee kaththaboon",
				"translations_en": "\"My Lord, indeed my people have denied me.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "فَافْتَحْ بَيْنِي وَبَيْنَهُمْ فَتْحًا وَنَجِّنِي وَمَن مَّعِيَ مِنَ الْمُؤْمِنِينَ",
				"transliteration": "Faftah baynee wabaynahum fathanwanajjinee waman maAAiya mina almu/mineen",
				"translations_en": "Then judge between me and them with decisive judgement and save me and those with me of the believers.\"",
				"bottom_en": "",
				"reference_en": "Surah Ash-Shu'araa - 26:117-118"
			}
		],
		"pageTitle_en": "Surah Ash-Shu'araa - 26:117-118"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ",
				"transliteration": "Rabbi najjinee waahlee mimma ya'maloon.",
				"translations_en": "My Lord, save me and my family from [the consequence of] what they do.",
				"bottom_en": "",
				"reference_en": "Surah Ash-Shu'araa - 26:169"
			}
		],
		"pageTitle_en": "Surah Ash-Shu'araa - 26:169"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
				"transliteration": "Rabbi awziAAnee an ashkura niAAmataka allateeanAAamta AAalayya waAAala walidayya waan aAAmala salihantardahu waadkhilnee birahmatika fee AAibadikaassaliheen",
				"translations_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.",
				"bottom_en": "",
				"reference_en": "Surah An-Naml - 27:19"
			}
		],
		"pageTitle_en": "Seeking gratefulness to Allah and approved deeds [27:19]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي وَأَسْلَمْتُ مَعَ سُلَيْمَانَ لِلَّهِ رَبِّ الْعَالَمِينَ",
				"transliteration": "rabbi innee thalamtunafsee waaslamtu maAAa sulaymana lillahi rabbi alAAalameen",
				"translations_en": "\"My Lord, indeed I have wronged myself, and I submit with Solomon to Allah , Lord of the worlds.\"",
				"bottom_en": "",
				"reference_en": "Surah An-Naml - 27:44"
			}
		],
		"pageTitle_en": "Surah 27:44"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
				"transliteration": "Rabbi innee thalamtunafsee faghfir lee faghafara lahu innahu huwa alghafooruarraheem",
				"translations_en": "My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ",
				"transliteration": "Qala  Rabbi bima anAAamtaAAalayya falan akoona thaheeran lilmujrimeen,",
				"translations_en": "Say: \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"",
				"bottom_en": "",
				"reference_en": "Surah Al-Qasas - 28:16-17"
			}
		],
		"pageTitle_en": "Surah Al-Qasas - 28:16-17"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
				"transliteration": "Rabbi najjinee mina alqawmi aththalimeen",
				"translations_en": "My Lord, save me from the wrongdoing people.",
				"bottom_en": "",
				"reference_en": "Surah Al-Qasas - 28:21"
			}
		],
		"pageTitle_en": "Seeking protection from wrongdoing people [28:21]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
				"transliteration": "Rabbi innee lima anzalta ilayya min khayrin faqeer",
				"translations_en": "My Lord, indeed I am, for whatever good You would send down to me, in need.",
				"bottom_en": "",
				"reference_en": "Surah Al-Qasas - 28:24"
			}
		],
		"pageTitle_en": "Seeking whatever good Allah can bestow [28:24]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ",
				"transliteration": "Rabbi onsurnee AAalaalqawmi almufsideen",
				"translations_en": "My Lord, support me against the corrupting people.",
				"bottom_en": "",
				"reference_en": "Surah Al-'Ankaboot - 29:30"
			}
		],
		"pageTitle_en": "Asking help againest corrupt people [29:30]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
				"transliteration": "Rabbi hablee mina assaliheen",
				"translations_en": "My Lord, grant me [a child] from among the righteous.",
				"bottom_en": "",
				"reference_en": "Surah As-Saaffaat - 37:100"
			}
		],
		"pageTitle_en": "Seeking a righteous child [37:100]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ ٱغْفِرْ لِى وَهَبْ لِى مُلْكًا لَّا يَنۢبَغِى لِأَحَدٍ مِّنۢ بَعْدِىٓ ۖ إِنَّكَ أَنتَ ٱلْوَهَّابُ",
				"transliteration": "rabbi ighfir lee wahab leemulkan la yanbaghee li-ahadin min baAAdee innakaanta alwahhab",
				"translations_en": "My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.",
				"bottom_en": "",
				"reference_en": "Surah Sad - 38:35"
			}
		],
		"pageTitle_en": "Surah Sad - 38:35"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ",
				"transliteration": "annee massaniya ashshaytanubinusbin waAAathab",
				"translations_en": "\"Indeed, Satan has touched me with hardship and torment.\"",
				"bottom_en": "",
				"reference_en": "Surah Sad - 38:41"
			}
		],
		"pageTitle_en": "Surah Sad - 38:41"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ",
				"transliteration": "Rabbana wasi'ta kulla sha'ir Rahmatanw wa 'ilman faghfir lilladhina tabu wattaba'u sabilaka waqihim 'adhabal-Jahiim",
				"translations_en": "Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُمْ وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۚ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ",
				"transliteration": "Rabbana wa adhkhilhum Jannati 'adninil-lati wa'attahum wa man salaha min aba'ihim wa azwajihim wa dhuriyyatihim innaka antal 'Azizul-Hakim,",
				"translations_en": "Our Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their fathers, their spouses and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.",
				"bottom_en": "",
				"reference_en": ""
			},
			{
				"top_en": "",
				"arabic": "وَقِهِمُ السَّيِّئَاتِ ۚ وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
				"transliteration": "waqihimus sayyi'at wa man taqis-sayyi'ati yawma'idhin faqad rahimatahu wa dhalika huwal fawzul-'Adheem",
				"translations_en": "And protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.",
				"bottom_en": "",
				"reference_en": "Surah Ghafir - 40:7-9"
			}
		],
		"pageTitle_en": "Surah Ghafir - 40:7-9"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "إِنِّي عُذْتُ بِرَبِّي وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ الْحِسَابِ",
				"transliteration": "innee AAuthtubirabbee warabbikum min kulli mutakabbirin la yu/minubiyawmi alhisab",
				"translations_en": "Indeed, I have sought refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Account.\"",
				"bottom_en": "",
				"reference_en": "Surah Ghafir - 40:27"
			}
		],
		"pageTitle_en": "Surah Ghafir - 40:27"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ ۚ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ",
				"transliteration": "waofawwidu amree ila Allahi inna Allahabaseerun bilAAibad",
				"translations_en": "and I entrust my affair to Allah . Indeed, Allah is Seeing of [His] servants.\"",
				"bottom_en": "",
				"reference_en": "Surah Ghafir - 40:44"
			}
		],
		"pageTitle_en": "Surah Ghafir - 40:44"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
				"transliteration": "Rabbi awzi'nee an ashkura ni'mataka allatee anAAamta AAalayya waAAalawalidayya waan aAAmala salihan tardahuwaaslih lee fee thurriyyatee innee tubtuilayka wa-innee mina almuslimeen",
				"translations_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.",
				"bottom_en": "",
				"reference_en": "Surah Al-Ahqaf - 46:15"
			}
		],
		"pageTitle_en": "Seeking gratefulness to Allah, approved deeds and righteous child [46:15]"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "أَنِّي مَغْلُوبٌ فَانتَصِرْ",
				"transliteration": "annee maghloobun fantasir",
				"translations_en": "\"Indeed, I am overpowered, so help.\"",
				"bottom_en": "",
				"reference_en": "Surah Qamar 54:10"
			}
		],
		"pageTitle_en": "Surah Qamar 54:10"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
				"transliteration": "Rabbana ighfir lana wali-ikhwaninaallatheena sabaqoona bil-eemani walatajAAal fee quloobina ghillan lillatheena amanoorabbana innaka raoofun raheem",
				"translations_en": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.",
				"bottom_en": "",
				"reference_en": "Surah Al-Hashr - 59:10"
			}
		],
		"pageTitle_en": "Surah Al-Hashr - 59:10"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ ٱلْمَصِيرُ",
				"transliteration": "rabbanaAAalayka tawakkalna wa-ilayka anabna wa-ilayka almaseer",
				"translations_en": "Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.",
				"bottom_en": "",
				"reference_en": "Surah Al-Mumtahina - 60:4"
			}
		],
		"pageTitle_en": "Surah Al-Mumtahina - 60:4"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
				"transliteration": "Rabbana atmim lana nurana waighfir lana innaka 'ala kulli shay-in qadir",
				"translations_en": "Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.",
				"bottom_en": "",
				"reference_en": "Surah At-Tahreem - 66:8"
			}
		],
		"pageTitle_en": "Surah At-Tahreem - 66:8"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
				"transliteration": "rabbiibni lee AAindaka baytan fee aljannati wanajjinee min firAAawnawaAAamalihi wanajjinee mina alqawmi aththalimeen",
				"translations_en": "My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.",
				"bottom_en": "",
				"reference_en": "Surah At-Tahreem - 66:11"
			}
		],
		"pageTitle_en": "Surah At-Tahreem - 66:11"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا",
				"transliteration": "rabbi latathar AAala al-ardi mina alkafireenadayyara",
				"translations_en": "My Lord, do not leave upon the earth from among the disbelievers an inhabitant.",
				"bottom_en": "",
				"reference_en": "Surah Nooh - 71:26"
			}
		],
		"pageTitle_en": "Surah Nooh - 71:26"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا",
				"transliteration": "Rabbi ighfir lee waliwalidayyawaliman dakhala baytiya mu'minan walil mu'mineena wal mu'minati wala tazidi aththalimeena illatabaran",
				"translations_en": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.",
				"bottom_en": "",
				"reference_en": "Surah Nooh - 71:28"
			}
		],
		"pageTitle_en": "Surah Nooh - 71:28"
	},
	{
		"duas": [
			{
				"top_en": "",
				"arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
				"transliteration": "Allāhumma innaka `Afuwwun, tuḥibbul-`afwa fa`fu `annī",
				"translations_en": "O Allah, indeed You are Pardoning, You love pardon, so pardon me",
				"bottom_en": "",
				"reference_en": "Sunan Ibn Majah : Book 34, Hadith 24"
			}
		],
		"pageTitle_en": "Dua of Laylatul Qadr"
	},
	{
		"duas": [
			{
				"top_en": "The Prophet (ﷺ) used to treat some of his wives by passing his right hand over the place of ailment and used to say,",
				"arabic": "أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا",
				"transliteration": "Adhhib il-ba’s, Rabbi l-naas washfi anta al-Shaafi laa shifaa’a illa shifaa’uka shifaa’an laa yughaadir saqaman",
				"translations_en": "Remove the harm, O Lord of mankind and heal him, for You are the Healer and there is no healing except Your healing, with a healing which does not leave any disease behind",
				"bottom_en": "",
				"reference_en": "Bukhari : Book 76, Hadith 65"
			}
		],
		"pageTitle_en": "Dua for the Sick"
	}
]
